#ifndef MSOUND_HPP
#define MSOUND_HPP

#include <dolphin/types.h>
#include <dolphin/mtx.h>

#include <JSystem/JKernel/JKRHeap.hpp>
#include <JSystem/JAudio/JASystem/JASTrackMgr.hpp>
#include <JSystem/JAudio/JASystem/JASWaveArcLoader.hpp>
#include <JSystem/JAudio/JAInterface/JAISound.hpp>
#include <JSystem/JAudio/JAInterface/JAIBasic.hpp>
#include <MSound/MSSceneWave.hpp>
#include <MSound/MSoundSE.hpp>

class JAIActor;
class JAICamera;
class JAIAnimeFrameSoundData;
class MSModBgm;
class MSBgmXFade;

// Exact order and names were pulled from mSound.asn
// NOTE: Moving this to the bottom of the file will cause startForceJumpSound to
// error!
enum MSoundSEId {
	MSD_SE_PO_WATER_HI          = 0x0000,
	MSD_SE_PO_WATER_LOW         = 0x0001,
	MSD_SE_PO_ACTION_ON_EMPTY   = 0x0802,
	MSD_SE_PO_PETBOTTLE_FLY     = 0x0003,
	MSD_SE_PO_WT_DRY_UP         = 0x0804,
	MSD_SE_PO_WATER_HI_TRG      = 0x0805,
	MSD_SE_PO_WATER_LOW_TRG     = 0x0806,
	MSD_SE_PO_HAND_OFF          = 0x0807,
	MSD_SE_PO_NOZZLE_OFF        = 0x0808,
	MSD_SE_PO_ACTION_ON         = 0x0809,
	MSD_SE_PO_ACTION_OFF        = 0x080A,
	MSD_SE_PO_FRICTION_A        = 0x080B,
	MSD_SE_PO_FRICTION_B        = 0x080C,
	MSD_SE_PO_FRICTION_C        = 0x080D,
	MSD_SE_PO_SUCK_WATER_A      = 0x080E,
	MSD_SE_PO_SUCK_WATER_B      = 0x000F,
	MSD_SE_PO_ACTION_OFF_EMPTY  = 0x0810,
	MSD_SE_SY_SELECT_POMP       = 0x0811,
	MSD_SE_SY_SELECT_POMP_BACK  = 0x0812,
	MSD_SE_PO_SHOTGUN_TRIGGER   = 0x0813,
	MSD_SE_PO_SNIPER_TRIGGER    = 0x0814,

	MSD_SE_NPC_VA_CMNTW_ANDO1   = 0x896F,
	MSD_SE_NPC_VA_CMNTW_ANDO2   = 0x8970,
	MSD_SE_NPC_VA_CMNTW_TROUB1  = 0x8971,
	MSD_SE_NPC_VA_CMNTW_TROUB2  = 0x8972,
	MSD_SE_NPC_VA_CMNTW_THROW1  = 0x8973,
	MSD_SE_NPC_VA_CMNTW_PRESS1  = 0x8974,
	MSD_SE_NPC_VA_CMNTW_PRESS2  = 0x8975,
	MSD_SE_NPC_VA_CMNTW_ATTENT  = 0x8976,
	MSD_SE_NPC_VA_CMNTW_DANCE1  = 0x8977,
	MSD_SE_NPC_VA_CMNTW_DANCE2  = 0x8978,
	MSD_SE_NPC_VA_CMNTW_RUNNING = 0x8979,
	MSD_SE_NPC_VA_CMAREM_JUMP1  = 0x897A,
	MSD_SE_NPC_VA_CMAREM_JUMP2  = 0x897B,
	MSD_SE_NPC_VA_CMAREM_SINK   = 0x897C,
	MSD_SE_NPC_VA_CMAREM_ANDO   = 0x897D,
	MSD_SE_NPC_VA_CMAREM_CONFUS = 0x897E,
	MSD_SE_NPC_VA_CMAREM_PRESS  = 0x897F,
	MSD_SE_NPC_VA_CMAREM_DANCE1 = 0x8980,
	MSD_SE_NPC_VA_CMAREM_DANCE2 = 0x8981,
	MSD_SE_NPC_VA_CMAREM_HUKKI  = 0x8982,
	MSD_SE_NPC_VA_CMAREW_ANGRY  = 0x8983,
	MSD_SE_NPC_VA_CMAREW_JUMP   = 0x8984,
	MSD_SE_NPC_VA_CMAREW_SINK   = 0x8985,
	MSD_SE_NPC_VA_CMAREW_ANDO   = 0x8986,
	MSD_SE_NPC_VA_CMAREW_CONFUS = 0x8987,
	MSD_SE_NPC_VA_CMAREW_PRESS  = 0x8988,
	MSD_SE_NPC_VA_CMAREW_DANCE1 = 0x8989,
	MSD_SE_NPC_VA_CMAREW_DANCE2 = 0x898A,
	MSD_SE_NPC_VA_CMAREW_HUKKI  = 0x898B,
	MSD_SE_NPC_VA_MTMAN_JUMP1   = 0x898C,
	MSD_SE_NPC_VA_MTMAN_JUMP2   = 0x898D,
	MSD_SE_BS_MANTA_DRAW_DEMO   = 0x818E,
	MSD_SE_BS_MANTA_ALL_DEATH   = 0x898F,
	MSD_SE_BS_MANTA_DAMAGE_1    = 0x8990,
	MSD_SE_BS_MANTA_DAMAGE_2    = 0x8991,
	MSD_SE_BS_MANTA_DAMAGE_3    = 0x8992,
	MSD_SE_BS_MANTA_DAMAGE_4    = 0x8993,
	MSD_SE_BS_MANTA_SEGMENT_1   = 0x8994,
	MSD_SE_BS_MANTA_SEGMENT_2   = 0x8995,
	MSD_SE_BS_MANTA_SEGMENT_3   = 0x8996,
	MSD_SE_BS_MANTA_SEGMENT_4   = 0x8997,
	MSD_SE_BS_MANTA_VANISH      = 0x8998,
	MSD_SE_BS_MANTA_DRAW_LV     = 0x8199,
	MSD_SE_BS_MANTA_DAMAGE_5    = 0x899A,
	MSD_SE_BS_MANTA_ATTACK      = 0x899B,
	MSD_SE_BS_KOOPA_HIP_ATTACK  = 0x899C,
	MSD_SE_BS_KOOPA_FLOOD       = 0x819D,
	MSD_SE_BS_KOOPA_JR_ATTACK   = 0x899E,
	MSD_SE_BS_KOOPA_JR_LAUGH    = 0x899F,
	MSD_SE_BS_KOOPA_WALK        = 0x89A0,
	MSD_SE_BS_KOOPA_BOUND       = 0x89A1,
	MSD_SE_BS_KOOPA_FIRE_START  = 0x89A2,
	MSD_SE_BS_KOOPA_FIRE_LOOP   = 0x81A3,
	MSD_SE_BS_KOOPA_VO_THREAT_0 = 0x89A4,
	MSD_SE_BS_KOOPA_VO_THREAT_1 = 0x89A5,
	MSD_SE_BS_KOOPA_VO_DAMAGE_0 = 0x89A6,
	MSD_SE_BS_KOOPA_VO_DAMAGE_1 = 0x89A7,
	MSD_SE_BS_KOOPA_PREPARE     = 0x89A8,
	MSD_SE_BS_KOOPA_WASH        = 0x89A9,
	MSD_SE_BS_KOOPA_VO_GROAN_0  = 0x89AA,
	MSD_SE_BS_KOOPA_VO_GROAN_1  = 0x89AB,
	MSD_SE_BS_KOOPA_VO_CRY      = 0x89AC,
	MSD_SE_BS_KOOPA_VO_LAUGH    = 0x89AD,
	MSD_SE_BS_KOOPA_WATER_DIVE  = 0x89AE,
	MSD_SE_BS_FALLWATER         = 0x89AF,
	MSD_SE_BS_KOOPA_JR_DAMAGE   = 0x89B0,
	MSD_SE_SUPER_HIP_DROP_FALL  = 0x81B1,
	MSD_SE_OBJ_BI_BELL          = 0x89B8,
	MSD_SE_OBJ_FLOWER_OPEN_0    = 0x89B9,
	MSD_SE_OBJ_FLOWER_OPEN_1    = 0x89BA,
	MSD_SE_OBJ_FLOWER_OPEN_2    = 0x89BB,
	MSD_SE_OBJ_FLOWER_OPEN_3    = 0x89BC,
	MSD_SE_OBJ_FLOWER_OPEN_4    = 0x89BD,
	MSD_SE_OBJ_FLOWER_OPEN_5    = 0x89BE,
	MSD_SE_OBJ_FLOWER_OPEN_6    = 0x89BF,
	MSD_SE_OBJ_FLOWER_OPEN_7    = 0x89C0,
	MSD_SE_SHINE_EXIST          = 0x81C1,
};

class MSSeCallBack {
public:
	static u16 setParameterSeqSync(JASystem::TTrack*, u16);
	static void setWaterFilter(u16);
	static void setWaterCameraFir(bool);
	static u16 smTrackCategory[];
	static u8 smPolifonic[];
	static u16 smWaterFilter;
};

class MSLoadWave {
public:
	static bool loadWaveBackword(int, int);
	static bool loadWaveBackword(JASystem::WaveArcLoader::TObject*);
};

class MSMarioPosVolume {
public:
	static f32 getDistFromMario(const Vec&);
};

class MSound : public JAIBasic {
public:
	MSound(JKRHeap*, JKRHeap*, u32, u8*, u8*, u32);
	~MSound() { }

	virtual JAISound* makeSound(u32);
	virtual u32 getMapInfoGround(u32) { return 0; }
	virtual void setSeExtParameter(JAISound*);
	virtual void setRegisterTrackCallback();
	virtual void loadGroupWave(s32, s32);

	static MSound* getMSound();

	void initSound();
	void mainLoop();
	void exitStage();
	void enterStage(MS_SCENE_WAVE, u8, u8);
	void loadWave(MS_SCENE_WAVE);
	void cleanUpAramWave(u8);
	bool checkWaveOnAram(MS_SCENE_WAVE);
	bool checkSeqOnMemory(u32);

	void stopAllSound();
	void fadeOutAllSound(u32);
	void stopAllSeInCategory(u8, u32);
	void setCategoryAllVolume(u8, f32, u32, u8);
	void setCategoryVOLs(u16, f32);
	void setCategoryVOLsDefault(u16);

	void pauseOn(bool);
	void pauseOff(u8);
	void talkModeIn(bool);
	void talkModeOut();
	void demoModeIn(u16, bool);
	void demoModeOut(bool);

	void setPlayerInfo(Vec*, Vec*, MtxPtr, bool);
	void setCameraInfo(Vec*, Vec*, MtxPtr, u32);
	f32 getDistFromCamera(Vec*);
	bool cameraLooksAtMario();

	void startSoundSet(u32, const Vec*, u32, f32, u32, u32, u8);
	void startSoundSetGrp(u32, const Vec*, u32, f32, u32, u32, u8);
	void startSoundActorSpecial(u32, const Vec*, f32, f32, u32, JAISound**, u32,
	                            u8);
	void startBeeSe(Vec*, u32);

	u32 startMarioVoice(u32, s16, u8);
	void stopMarioVoice(u32, u8);
	u32 getMarioVoiceID(u8);
	void* checkMarioVoicePlaying(u8);

	void playTimer(u32);
	void requestShineAppearFanfare();

	u32 getWallSound(u32, f32);
	u32 getBstPitch(u32);
	static u32 getBstSwitch(u32);
	static u32 getSwitch(u32, u32, u32);
	bool gateCheck(u32);

	bool resetAudioAll(u16);

	// real
	void startSoundSystemSE(u32 param_1, u32 param_2, JAISound** param_3,
	                        u32 param_4)
	{
		if (gateCheck(param_1))
			MSoundSESystem::MSoundSE::startSoundSystemSE(param_1, param_2,
			                                             param_3, param_4);
	}

	// Fabricated, very likely due to real startSoundSystemSE
	void startSoundActor(u32 param_1, const Vec* param_2, u32 param_3,
	                     JAISound** param_4, u32 param_5, u8 param_6)
	{
		if (gateCheck(param_1))
			MSoundSESystem::MSoundSE::startSoundActor(
			    param_1, param_2, param_3, param_4, param_5, param_6);
	}

	void startSoundActorWithInfo(u32 param_1, const Vec* param_2, Vec* param_3,
	                             f32 param_4, u32 param_5, u32 param_6,
	                             JAISound** param_7, u32 param_8, u8 param_9)
	{
		if (gateCheck(param_1))
			MSoundSESystem::MSoundSE::startSoundActorWithInfo(
			    param_1, param_2, param_3, param_4, param_5, param_6, param_7,
			    param_8, param_9);
	}

	void startForceJumpSound(Vec* param_1, u32 param_2, f32 param_3,
	                         u32 param_4)
	{
		u32 r31;
		switch (param_2 & 0xff) {
		case 0x15:
		case 0x17:
		case 0x1D:
			r31 = MSD_SE_MA_STALL_JUMP;
			break;

		case 0x1E:
		default:
			if (param_4 < 0x1770)
				r31 = MSD_SE_MA_ROPE_JUMP_A;
			else if (param_4 < 0x2EE0)
				r31 = MSD_SE_MA_ROPE_JUMP_B;
			else
				r31 = MSD_SE_MA_ROPE_JUMP_C;
			break;
		}

		if (gateCheck(r31))
			startSoundActor(r31, param_1, 0, nullptr, 0, 4);
	}

	bool checkUnkA8(u32 flag) { return !(unkA8 & flag) ? false : true; }

public:
	/* 0x98 */ MSModBgm* unk98;
	/* 0x9C */ MSBgmXFade* unk9C;
	/* 0xA0 */ u32 unkA0;
	/* 0xA4 */ u32 unkA4;
	/* 0xA8 */ u8 unkA8;
	/* 0xAC */ JAICamera unkAC[2];
	/* 0xC4 */ JAISound* unkC4;
	/* 0xC8 */ u8 unkC8[5];
	/* 0xCD */ u8 unkCD;
	/* 0xCE */ u8 unkCE;
	/* 0xCF */ u8 unkCF;
	/* 0xD0 */ u8 unkD0;
	/* 0xD1 */ u8 unkD1;
	/* 0xD2 */ char unkD2[0x304 - 0xD2];
	/* 0x304 */ JASystem::TTrack::TOuterParam* unk304;
	/* 0x308 */ char unk308[0x4];
};

extern MSound* MSGMSound;
extern JAIBasic* MSGBasic;
extern MSound* gpMSound;

// real
MSound* SMSGetMSound() { return gpMSound; }

#endif // MSOUND_HPP
